08-rails/moma/app/views/artists/show.html.erb

SELECT  1 AS one FROM "works" WHERE "works"."artist_id" = $1 LIMIT $2  [["artist_id", 9], ["LIMIT", 1]]
SELECT "works".* FROM "works" WHERE "works"."artist_id" = $1  [["artist_id", 12]]
---

<% unless @artist.works.empty? %>