09-tdd/fruitstore/app/controllers/fruits_controller.rb

  def index
    @fruits = Fruit.order('created_at DESC') # This is faster than Fruit.all.reverse
---
SELECT "fruits".* FROM "fruits" ORDER BY created_at DESC