08-rails/moma/app/views/works/show.html.erb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
---
<ul>
    <% if @work.artist.present? %>