12-react/secrets_server/app/controllers/secrets_controller.rb

SELECT "secrets".* FROM "secrets" ORDER BY created_at DESC
---
  def index
    @secrets = Secret.order('created_at DESC')

INSERT INTO "secrets" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", "cool!!!!!\r\nyes"], ["created_at", "2018-04-17 01:06:04.451761"], ["updated_at", "2018-04-17 01:06:04.451761"]]
---
  def create
    @secret = Secret.new(secret_params)

    respond_to do |format|
      if @secret.save

SELECT  "secrets".* FROM "secrets" WHERE "secrets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_secret
      @secret = Secret.find(params[:id])