08-rails/moma/app/controllers/works_controller.rb

  def index
    @works = Work.all.order(:created_at) # or just Work.all.order
---
SELECT "works".* FROM "works" ORDER BY "works"."created_at" ASC

  def create
    work = Work.create work_params
---
INSERT INTO "works" ("title", "year", "medium", "style", "image", "created_at", "updated_at", "artist_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"  [["title", ""], ["year", ""], ["medium", ""], ["style", ""], ["image", ""], ["created_at", "2018-03-28 05:56:01.834712"], ["updated_at", "2018-03-28 05:56:01.834712"], ["artist_id", 14]]

  def update
    work = Work.find params[:id]
    work.update work_params
---
SELECT  "works".* FROM "works" WHERE "works"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "works" SET "artist_id" = $1, "updated_at" = $2 WHERE "works"."id" = $3  [["artist_id", 13], ["updated_at", "2018-03-28 05:17:52.606557"], ["id", 1]]

  def destroy
    work = Work.find params[:id]
    work.destroy
---
SELECT  "works".* FROM "works" WHERE "works"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
DELETE FROM "works" WHERE "works"."id" = $1  [["id", 8]]