08-rails/solar_system/app/controllers/planets_controller.rb

  def create
    planet = Planet.create planet_params
---
INSERT INTO "planets" ("name", "image", "orbit", "diameter", "mass", "moons") VALUES (?, ?, ?, ?, ?, ?)  [["name", "m, ,m "], ["image", "http://internetlooks.com/mars03.gif"], ["orbit", 8.0], ["diameter", 89979897979.0], ["mass", 798789798787.0], ["moons", 8]]

  def destroy
    planet = Planet.find params[:id]
    planet.destroy
---
SELECT  "planets".* FROM "planets" WHERE "planets"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "planets" WHERE "planets"."id" = ?  [["id", 7]]

  def update
    planet = Planet.find params[:id]
    planet.update planet_params
---
SELECT  "planets".* FROM "planets" WHERE "planets"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "planets" SET "image" = ? WHERE "planets"."id" = ?  [["image", "http://internetlooks.com/mars03.gif"], ["id", 6]]